Shubuo/SD.SPI.FATFS-Stm32F103/main.c
	return sum;

}

double 				IIR(int M){
	
	
	for(i=M;i>0;i--){
		
		sensor[i] = ReadCount();
	}
	
	sensor[0] = ReadCount();
	
	sumA = 0;
	sumB = 0;
	
	for(i=0;i<M;i++){
		
		sumB = sumB + sensor[i]*IIR_B[i];	
		
	}
	
	for(i=0;i<(M-1);i++){
	
		sumA = sumA + y[i]*IIR_A[i+1];
	}
			
	for(i=0;i<M;i++){
	
		y[i+1] = y[i];
	}	
	
	y[0] = sumB - sumA;
	
	return (sumB - sumA);
	
}

double 				Kalmans(void){
	
	// Valor Medido
	MEA = ReadCount();
	
	// Kalmans Filter Gain
	KG = ERROR_E0/(ERROR_E0 + ERROR_MEA);
		
	// Updating Estimative
	E_E1 = E_E0;
	E_E0 = E_E1 + KG*(MEA - E_E1);
	
	// Updating Error	
	ERROR_E1 = ERROR_E0;	
	ERROR_E0 = (1-KG)*ERROR_E1;
	
	return E_E0;
	
	
}

double 				Get_Tara(void){
	
	long 	auxTara 	= 0;
	long 	auxTara2 	= 0;
							
	for(i=0;i<20;i++){
		
		auxTara = ReadCount();
		auxTara2 += auxTara;
		
	}
					
	Tara = auxTara2/20;
	return Tara;
}
void 					Wait_Start_Measuring(int Peso_Minimo){
	
	
	for(i=0;i<10;i++)
	aForce = ReadCount();	
	
	Force = fabs((aForce - Tara)*(0.00238));
	
	MEA_Abort = false;
	
	while( !MEA_Abort && Force < Peso_Minimo){	
		
		aForce = ReadCount();	
		Force = fabs((aForce - Tara)*(0.00238));
	}
	
}
void 					Measuring(void){
		
	while(estado == 0x01 && Force > 100){	
		
						aForce = ReadCount();	
						Force = fabs((aForce - Tara)*(0.00238));
		
						LCD_CURSOR(0,0);
						sprintf(UART_MEA_SEND,"%7.2f",Force);						
						ENVIA_STRING_LCD(UART_MEA_SEND);				
						HAL_UART_Transmit_IT(&huart3, UART_MEA_SEND ,sizeof(UART_MEA_SEND));
	}
	
}
void 					Measuring_Vector(double Aux_Vector[]){
	
	int m =0;
	
	while(estado == 0x01 && Force > 100){	
		
		aForce = ReadCount();	
		Force = fabs((aForce - Tara)*(0.00238));
		Aux_Vector[m] = Force;
		m++;		
		
	}
	
}
double 				Maior_Valor_Vector(double Aux_Vector[]){

	
	int m =1;
	double Maior_Valor_Function =0;
	
	for(i=1;i<100;i++){
			
			if(Aux_Vector[m] > Aux_Vector[m-1]){
			
				Maior_Valor_Function = Aux_Vector[m];
			}	
		
		m++;		
		}
	
		return Maior_Valor_Function;
	}
	

void					UART_Received(void){

	HAL_UART_Receive(&huart3,UART_RX,sizeof(UART_RX),250);
			
		if(UART_RX[0] == 'H'){			
			Recebendo = 1;			
					
		}
		
		else if(UART_RX[0] == 'H'){			
			Recebendo = 1;			
					
		}
		
		else if(UART_RX[0] == 'H'){			
			Recebendo = 1;			
					
		}
		
		else if(UART_RX[0] == 'H'){			
			Recebendo = 1;			
						
		}
		
		else if(UART_RX[0] == 'H'){			
			Recebendo = 1;			
						
		}
		
		if(UART_RX[0] == 'F'){			
			n =0;
			Recebendo = 0;	
			updateRTC	= true;		
		}
		
		if(Recebendo == 1){
			
			if(UART_RX[0] != 'H'){
				UART_H1[n] = UART_RX[0];
				n++;
				Recebendo = 0;
			}
		}	
	
		else if(UART_RX[0] == '1'){
			estado = 0x01;
			Start_MEA = true;			
		}
		
		else if(UART_RX[0] == '4'){
			UART_RX[0] = '1';
			Start_MEA = true;
			
		}
		
		else if(UART_RX[0] == '3'){
			estado = 0x03;
			teste = 0;
		}
		
		else if(UART_RX[0] == '5'){
			estado = 0x05;
			teste = 0;	
		}
		
		else if(UART_RX[0] == '9'){
			estado = 0x09;
			teste = 0;
		}
				
}

	
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
	

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
	
	
	
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FATFS_Init();
  MX_RTC_Init();
  MX_SPI2_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
	MEA_READY_LOW();
	LCD_INICIALIZA();			
	
	ENVIA_STRING_LCD("MENU");
	
	if(FC_UP_Read()){	
		RELE2_HIGH();
	}
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
		
//		while(!FimCurso_UP_Read()){
//			RELE2_HIGH() ;
//			ENVIA_STRING_LCD("1on1");

//		}
//		while(!FimCurso_DOWN_Read()){
//			RELE1_HIGH() ;
//			ENVIA_STRING_LCD("2on2");

//		}
//		
//		RELE2_LOW();
//		RELE1_LOW();
//		ENVIA_STRING_LCD("OFF");
		
		
		
		if(UART_RX_FLAG){
			UART_Received();
			UART_RX_FLAG = false;
		}

		switch(estado){
			
			case 0x01:
			{				
				if(Start_MEA){
					MEA_READY_LOW();
					Start_MEA = false;
					LCD_LIMPA();
					ENVIA_STRING_LCD("INICIAR");
										
					LCD_LIMPA();
					ENVIA_STRING_LCD("Tara");
					Tara = Get_Tara();
					LCD_LIMPA();
					
					for(i=0;i<100;i++){
						Vector_MEA[i] = 0;
					}
					
					ENVIA_STRING_LCD("Aguardando Ini.");
					MEA_READY_HIGH();																		//	Avisa arduino que pode inicar FORCA											
					RELE1_HIGH();																				//	Ativa o motor	
					Wait_Start_Measuring(100);													//	Esperar ate 100gramas		
					LCD_LIMPA();
					Measuring_Vector(Vector_MEA);
					Maior_Valor = Maior_Valor_Vector(Vector_MEA);					
					MEA_READY_LOW();																		//	Avisa arduino que medicao parou		
					
					if(estado == 0x01){
						for(i=0;i<100;i++){						
							Vector_Last_MEA[i] = Vector_MEA[i];
						}
					}
					RELE1_LOW();																				//	Desliga motor
					sprintf(UART_MEA_SEND,"%7.2f",Maior_Valor);									
					HAL_UART_Transmit(&huart3, UART_MEA_SEND ,sizeof(UART_MEA_SEND),250);
					RELE2_HIGH();
																								

				}			
				
					
			break; 
			}
			
			case 0x03:
			{					
				if(!DoneGRF){
					
					HAL_Delay(100);
					LCD_LIMPA();
					ENVIA_STRING_LCD("GRAFICO");
					teste = 1;			
				
				int mm = 0;	
				
				while(Sending_Vector){
					
					UART_AUX_Sending = Vector_Last_MEA[mm];
					mm++;
					sprintf(UART_MEA_SEND,"%7.0f",UART_AUX_Sending);						
					HAL_UART_Transmit(&huart3, UART_MEA_SEND ,sizeof(UART_MEA_SEND),250);
					HAL_Delay(100);
					
					if(UART_AUX_Sending == 0){
						
						estado 					= 0x09;
						DoneGRF 				= true;
						Sending_Vector 	= false;
						teste							= 0;
						HAL_Delay(100);
						
